// "Получили данные с сервера"
const state = {
    profilePage: {
        postsData: [
            { id: 1, message: "Объект Console служит для доступа к средствам отладки браузера (например, Web Console (Веб-консоль) в Firefox). Работа с ним отличается в разных браузерах, но эти методы и свойства по факту поддерживаются всеми браузерами." },
            { id: 2, message: "Объект Console служит для доступа к средствам отладки браузера (например, Web Console (Веб-консоль) в Firefox). Работа с ним отличается в разных браузерах, но эти методы и свойства по факту поддерживаются всеми браузерами." },
            { id: 3, message: "Объект Console служит для доступа к средствам отладки браузера (например, Web Console (Веб-консоль) в Firefox). Работа с ним отличается в разных браузерах, но эти методы и свойства по факту поддерживаются всеми браузерами." },
            { id: 4, message: "Объект Console служит для доступа к средствам отладки браузера (например, Web Console (Веб-консоль) в Firefox). Работа с ним отличается в разных браузерах, но эти методы и свойства по факту поддерживаются всеми браузерами." },
            { id: 5, message: "Объект Console служит для доступа к средствам отладки браузера (например, Web Console (Веб-консоль) в Firefox). Работа с ним отличается в разных браузерах, но эти методы и свойства по факту поддерживаются всеми браузерами." }
        ],
    },
    messagesPage: {
        dialogsData: [
            { id: 1, name: 'Andrey' },
            { id: 2, name: 'Timur' },
            { id: 3, name: 'Evgen' },
            { id: 4, name: 'Kostya' },
            { id: 5, name: 'Alex' }
        ],
        messagesData: [
            { id: 1, message: 'Hello' },
            { id: 2, message: 'Bla' },
            { id: 3, message: 'Ept' },
            { id: 4, message: 'Hi' },
            { id: 5, message: 'Help' }
        ],
    },
    friends: [
        
        { id: 6, name: 'Eva' },
        { id: 7, name: 'Inna' },
        { id: 8, name: 'Klava' },
        
    ]  
}
//
export default state;